In [1]:
import pandas as pd

In [2]:
ret = pd.read_csv('unique_titles.csv')
ret = pd.read_csv('unique_titles.csv')

In [3]:
ret.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 90398 entries, 0 to 90397
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   emp_no      90398 non-null  int64
 1   first_name  90398 non-null  object
 2   last_name   90398 non-null  object
 3   title       90398 non-null  object
dtypes: int64(1), object(3)
memory usage: 2.8+ MB

In [4]:
ret.head()

   emp_no first_name last_name            title
0   10001     Georgi   Facello  Senior Engineer
1   10004  Chirstian   Koblick  Senior Engineer
2   10005    Kyoichi  Maliniak     Senior Staff
3   10006     Anneke   Preusig  Senior Engineer
4   10009     Sumant      Peac  Senior Engineer

In [5]:
ret.groupby('title').count()

                    emp_no  first_name  last_name
title
Assistant Engineer    1761        1761       1761
Engineer             14222       14222      14222
Manager                  2           2          2
Senior Engineer      29414       29414      29414
Senior Staff         28255       28255      28255
Staff                12242       12242      12242
Technique Leader      4502        4502       4502